export const REGIONS = { 
  '서울특별시': {
    '강남구': ['역삼동', '삼성동', '청담동'],
    '강동구': ['천호동', '길동', '명일동'],
    '강북구': ['미아동', '번동', '수유동'],
    '강서구': ['화곡동', '등촌동', '가양동'],
    '관악구': ['신림동', '봉천동', '조원동'],
    '광진구': ['구의동', '자양동', '화양동'],
    '구로구': ['신도림동', '구로동', '고척동'],
    '금천구': ['독산동', '시흥동', '가산동'],
    '노원구': ['상계동', '중계동', '월계동'],
    '도봉구': ['창동', '쌍문동', '방학동'],
    '동대문구': ['제기동', '청량리동', '휘경동'],
    '동작구': ['노량진동', '상도동', '대방동'],
    '마포구': ['홍대입구', '상수동', '합정동'],
    '서대문구': ['신촌동', '연희동',  '홍제동'],
    '서초구': ['서초동', '방배동', '잠원동'],
    '성동구': ['성수동', '행당동', '금호동'],
    '성북구': ['안암동', '정릉동', '길음동'],
    '송파구': ['잠실동', '문정동', '가락동'],
    '양천구': ['신월동', '목동', '신정동'],
    '영등포구': ['여의도동', '당산동', '영등포동'],
    '용산구': ['이태원동', '한남동', '용산동'],
    '은평구': ['불광동', '신사동', '응암동'],
    '종로구': ['종로1가', '청운효자동', '사직동'],
    '중구': ['명동', '을지로동', '신당동'],
    '중랑구': ['면목동', '상봉동', '중화동'], 
  }
};

export const AREA_BUCKETS = ['~5평','5~10평','10~15평','15~20평','20~25평','25평~'];
export const FLOORS = ['반지하','저층(1~3F)','중층(4~8F)','고층(9F~)'];
export const DIRECTIONS = ['동','서','남','북','남동','남서','북동','북서'];
export const INFRA_KEYS = [
  {key:'mart',label:'편의점/마트'},
  {key:'hospital',label:'병원/약국'},
  {key:'bus',label:'버스/지하철'}
];

export const DEFAULT_PRICE = { depositMin:0, depositMax:5000, rentMin:0, rentMax:200 };
